In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
import pylab
import sys

if not sys.warnoptions:
    import warnings
    warnings.simplefilter("ignore")

In [2]:
data = pd.read_csv('titanic.csv')

In [3]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
data.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
data.isnull().sum()  ### Displaying the total number of null values

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
median=data['Age'].median()
median

28.0

In [11]:
data['Age']=data['Age'].fillna(data['Age'].median())

In [13]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [14]:
data['Embarked'].mode()[0]

'S'

In [15]:
data['Embarked']=data['Embarked'].fillna(data['Embarked'].mode()[0])

In [16]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [18]:
df=pd.read_csv('titanic.csv', usecols=['Age','Fare', 'Sex', 'Pclass','Survived'])

In [21]:
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [24]:
X = df.drop('Survived', axis=1)
y = df['Survived']

In [30]:
X = pd.get_dummies(X, drop_first=True)
X.head()

   Pclass   Age     Fare  Sex_female  Sex_male
0       3  22.0   7.2500           0         1
1       1  38.0  71.2833           1         0
2       3  26.0   7.9250           1         0
3       1  35.0  53.1000           1         0
4       3  35.0   8.0500           0         1

In [31]:
X.drop(['Sex_male'], axis=1, inplace=True)

In [32]:
X.head()

   Pclass   Age     Fare  Sex_female
0       3  22.0   7.2500           0
1       1  38.0  71.2833           1
2       3  26.0   7.9250           1
3       1  35.0  53.1000           1
4       3  35.0   8.0500           0

In [33]:
X.isnull().sum()

Pclass          0
Age           177
Fare            0
Sex_female      0
dtype: int64

In [35]:
X.Age = X.Age.fillna(X.Age.mean())

In [36]:
X.isnull().sum()

Pclass        0
Age           0
Fare          0
Sex_female    0
dtype: int64

In [37]:
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import GaussianNB

In [38]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=101)

In [39]:
model = GaussianNB()

In [40]:
model.fit(X_train, y_train)

GaussianNB()

In [41]:
model.score(X_test, y_test)

0.753731343283582

In [42]:
X_test[0:5]

     Pclass        Age     Fare  Sex_female
331       1  45.500000   28.500           0
700       1  18.000000  227.525           1
748       1  19.000000   53.100           0
751       3   6.000000   12.475           0
481       2  29.699118    0.000           0

In [43]:
y_test[0:5]

331    0
700    1
748    0
751    1
481    0
Name: Survived, dtype: int64

In [44]:
model.predict(X_test[0:5])

array([0, 1, 0, 0, 0], dtype=int64)

In [48]:
model.predict_proba(X_test[0:5])

array([[7.97620578e-01, 2.02379422e-01],
       [7.40511280e-11, 1.00000000e+00],
       [6.41220609e-01, 3.58779391e-01],
       [9.56932472e-01, 4.30675279e-02],
       [9.30014031e-01, 6.99859691e-02]])

In [56]:
from sklearn.model_selection import cross_val_score

In [59]:
score = cross_val_score(model, X_train, y_train, cv=5)
score.mean()

0.7817032258064517